{
  "name": "Intermediate Python Development",
  "slug": "intermediate-python-development",
  "keepStatus": "keepCandidate",
  "description": "This lesson covers intermediate Python development skills such as writing reusable code, using virtual environments, testing with pytest, and managing dependencies.",
  "url": "https://carpentries-incubator.github.io/python-intermediate-development/",
  "author": "Carpentries Incubator Team",
  "license": "https://creativecommons.org/licenses/by/4.0/",
  "learnerCategory": "Maintaining & Sustaining Software",
  "educationalLevel": "Intermediate",
  "ossRole": "Contributor, Maintainer",
  "subTopic": "",
  "timeRequired": "",
  "learningResourceType": "Tutorial",
  "inLanguage": [
    "English"
  ],
  "keywords": [
    "Python",
    "software development",
    "testing",
    "virtual environments",
    "packaging"
  ],
  "topic": "Python",
  "sortingId": "29",
  "dependsOn": "39 - Python Basics",
  "learningObjectives": "Inspect the structure and architecture of our software project.\nUnderstand Model-View-Controller (MVC) architecture in software design and its use in our project.\nSet up a Python virtual environment for our software project using venv and pip.\nRun our software from the command line.\nSet up a (virtual) development environment in an IDE\nUse the IDE to run a Python script\nCommit changes in a software project to a local repository and publish them in a remote repository on GitHub\nCreate branches for managing different threads of code development\nLearn to use feature branch workflow to effectively collaborate with a team on a software project\nUnderstand the benefits of following community coding conventions\nUse code linting tools to verify a program’s adherence to a Python coding style convention.\nExplain the reasons why testing is important\nDescribe the three main types of tests and what each are used for\nImplement and run unit tests to verify the correct behaviour of program functions\nUse parameterisation to automatically run tests over a set of inputs\nUse code coverage to understand how much of our code is being tested using unit tests\nUse continuous integration to automatically run unit tests and code coverage when changes are committed to a version control repository\nUse a debugger to explore behaviour of a running program\nDescribe and identify edge and corner test cases and explain why they are important\nApply error handling and defensive programming techniques to improve robustness of a program\nDescribe the differences between writing code and engineering software.\nDefine the fundamental stages in a software development process.\nDescribe the different types of software requirements.\nList the common aspects of software architecture and design.\nIntroduce appropriate abstractions to simplify code.\nUnderstand the use of regressions tests to avoid breaking existing code when refactoring.\nAnalyse new code to identify Model, View, Controller aspects.\nUnderstand the code review process and employ it to improve the quality of code.\nUnderstand other documentation components and where they are useful\nDescribe the basic types of open source software licence\nDescribe the steps necessary for sharing Python code as installable packages.\nUse established tools to track and manage software problems and enhancements in a team.\nConduct an assessment of software against suitability criteria",
  "ospoRelevance": "Moderate",
  "about": "",
  "abstract": "This lesson is designed to teach intermediate Python development skills, covering best practices in software development, such as packaging, testing, and version control.",
  "accessibilitySummary": "",
  "audience": "Python Developers, Researchers, Data Scientists",
  "competencyRequired": "Basic Python programming skills",
  "contributor": "",
  "creativeWorkStatus": "active",
  "dateCreated": "2021-08-01T09:00:00+00:00",
  "dateModified": "2023-02-15T14:40:12+00:00",
  "datePublished": "2021-09-01T14:00:00+00:00",
  "hasPart": "",
  "identifier": "https://carpentries-incubator.github.io/python-intermediate-development/",
  "isPartOf": "Carpentries Incubator Python Training Series",
  "notes": "",
  "mentions": "pytest, https://docs.pytest.org, A testing framework for Python",
  "recordedAt": "",
  "teaches": "Intermediate skills in collaborative research software development, including version control, testing, packaging, documentation, and sustainable coding practices using Python.",
  "version": "1.0.0",
  "workTranslation": ""
}
