{
  "name": "Reproducible Research",
  "slug": "reproducible-research",
  "keepStatus": "keepCandidate",
  "description": "This lesson covers the principles of reproducible research, including data management, version control, and the use of tools like Git to ensure that research can be replicated.",
  "url": "https://book.the-turing-way.org/reproducible-research/reproducible-research",
  "author": "The Turing Way Team",
  "license": "https://creativecommons.org/licenses/by/4.0/",
  "learnerCategory": "Maintaining & Sustaining Software",
  "educationalLevel": "Intermediate",
  "ossRole": "Contributor, Maintainer",
  "subTopic": "",
  "timeRequired": "",
  "learningResourceType": "Guide",
  "inLanguage": [
    "English"
  ],
  "keywords": [
    "reproducible research",
    "version control",
    "data management",
    "open science"
  ],
  "topic": "Research",
  "sortingId": "25",
  "dependsOn": "No programming experience needed.  It would be best for a student who has experience with research papers and research projects and wants to detailed understanding of terms and concepts, but that is not necessary.",
  "learningObjectives": "Extremely comprehensive with detailed explanations on concepts related to Research Code, Data, LLM, Hardware.  It is not a class.  This would be useful as a resource for self sturdy for someone interested in get a overview of Research and  all aspects.  The examples illustrate the concepts but are detailed coding examples.  Students learn why Reproducible Research is important, policy issues around Reproducible Research, detailed definitions that are finely  parsed for different ascpects of research, use of git, licensing/IP discussions, research ethics, setting up pojects.\nThere are exercise using code provided for the class.",
  "ospoRelevance": "High",
  "about": "",
  "abstract": "This lesson introduces the concept of reproducible research, explaining best practices and tools to ensure that scientific results can be replicated by others.",
  "accessibilitySummary": "",
  "audience": "Researchers, Open Science Contributors, Software Developers",
  "competencyRequired": "Basic understanding of research methodologies and tools for reproducibility",
  "contributor": "",
  "creativeWorkStatus": "active",
  "dateCreated": "2020-03-01T09:00:00+00:00",
  "dateModified": "2023-06-20T14:40:12+00:00",
  "datePublished": "2020-04-01T14:00:00+00:00",
  "hasPart": "",
  "identifier": "https://book.the-turing-way.org/reproducible-research/reproducible-research",
  "isPartOf": "The Turing Way",
  "notes": "",
  "mentions": "Git, https://git-scm.com, A version control tool for ensuring reproducibility in research projects",
  "recordedAt": "",
  "teaches": "The student will be able to apply best practices for reproducible research, including using Git for version control and managing research data.",
  "version": "1.0.0",
  "workTranslation": ""
}
